Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
acon-backend-getRuns-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241216091150611600000037]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241216091150708300000038]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples-20241216091150607100000036]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets-2024121609114953060000002e]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets-20241216091150031900000030]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets-2024121609114946730000002d]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses-2024121609115322720000003e]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses-2024121609115115730000003c]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::209479276142:policy/sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses-2024121609115117160000003d]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns-20241216091150396500000035]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns-20241216091150307300000033]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns-20241216091150372500000034]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals-2024121609115104280000003a]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals-20241216091150853400000039]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals-2024121609115104990000003b]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-p1j7zs5epd-6sxrls-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-p1j7zs5epd-bxlmkl-GET-200]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-20241216091150125600000031]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-2024121609115002770000002f]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy_attachment.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants-20241216091150248300000032]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-p1j7zs5epd-6sxrls-ANY-200]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-p1j7zs5epd-vttodl-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-p1j7zs5epd-myqnc6-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-p1j7zs5epd-orthd2-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-kxfncf-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-p1j7zs5epd-e6dgaj-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-myqnc6-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-p1j7zs5epd-e6dgaj-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-p1j7zs5epd-2f7zka-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-kxfncf-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-p1j7zs5epd-vttodl-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-p1j7zs5epd-2f7zka-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-p1j7zs5epd-orthd2-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-p1j7zs5epd-3y9on5-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-p3lszv-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-p1j7zs5epd-3ilqkw-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-p1j7zs5epd-061u46-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-bi6teq-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-pkz5u5-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-p1j7zs5epd-3ilqkw-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-p3lszv-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-p1j7zs5epd-qrf5h8-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-p1j7zs5epd-061u46-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-p1j7zs5epd-qrf5h8-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-p1j7zs5epd-3y9on5-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-p1j7zs5epd-bi6teq-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-pkz5u5-POST]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-fkkkww-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-p1j7zs5epd-96tmkw-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-6qcfw8-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-p1j7zs5epd-fkkkww-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-p1j7zs5epd-5m5pc5-GET]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-p1j7zs5epd-5m5pc5-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-p1j7zs5epd-96tmkw-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-6qcfw8-GET]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-p1j7zs5epd-myqnc6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-p1j7zs5epd-vttodl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-p1j7zs5epd-e6dgaj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-p1j7zs5epd-e6dgaj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-myqnc6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-p1j7zs5epd-orthd2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-p1j7zs5epd-2f7zka-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-p1j7zs5epd-3y9on5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-p3lszv-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-p1j7zs5epd-3ilqkw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-p1j7zs5epd-061u46-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-p1j7zs5epd-3ilqkw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-p3lszv-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-p1j7zs5epd-qrf5h8-GET-200]
module.svep.data.archive_file.binaries_layer: Still reading... [1m10s elapsed]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-p1j7zs5epd-061u46-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-p1j7zs5epd-qrf5h8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-kxfncf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-p1j7zs5epd-3y9on5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-p1j7zs5epd-bi6teq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-p1j7zs5epd-2f7zka-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-p1j7zs5epd-orthd2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-pkz5u5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-kxfncf-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-fkkkww-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-p1j7zs5epd-5m5pc5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-p1j7zs5epd-5m5pc5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-p1j7zs5epd-fkkkww-GET-200]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-p1j7zs5epd-1lvq4s-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-p1j7zs5epd-mhpnyr-POST]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-p1j7zs5epd-1hk20m-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-p1j7zs5epd-1hk20m-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-p1j7zs5epd-msfc74-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-zoa8jx-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-p1j7zs5epd-1lvq4s-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-zoa8jx-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-p1j7zs5epd-mhpnyr-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-msfc74-POST]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-p1j7zs5epd-96tmkw-GET-200]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-p1j7zs5epd-w5wgny-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-p1j7zs5epd-9nvf3o-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-p1j7zs5epd-fm9uc0-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-p1j7zs5epd-0n3ibk-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-p1j7zs5epd-cbov0g-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-p1j7zs5epd-9nvf3o-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-p1j7zs5epd-cbov0g-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-0n3ibk-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-p1j7zs5epd-w5wgny-POST]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-p1j7zs5epd-fm9uc0-POST]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-6qcfw8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-bi6teq-POST-200]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-p1j7zs5epd-cbov0g-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-pkz5u5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-p1j7zs5epd-1lvq4s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-p1j7zs5epd-mhpnyr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-p1j7zs5epd-1hk20m-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-p1j7zs5epd-1hk20m-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-zoa8jx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-p1j7zs5epd-mhpnyr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-zoa8jx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-p1j7zs5epd-w5wgny-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-9nvf3o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-p1j7zs5epd-fm9uc0-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-p1j7zs5epd-0n3ibk-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-p1j7zs5epd-6qcfw8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-p1j7zs5epd-cbov0g-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-0n3ibk-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-p1j7zs5epd-msfc74-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-p1j7zs5epd-fm9uc0-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-p1j7zs5epd-96tmkw-POST-200]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-p1j7zs5epd-iife4h-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-p1j7zs5epd-iife4h-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-p1j7zs5epd-wsmws4-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-p1j7zs5epd-prezne-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-p1j7zs5epd-wsmws4-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-p1j7zs5epd-a7x5k5-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-p1j7zs5epd-a7x5k5-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-p1j7zs5epd-prezne-GET]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-p1j7zs5epd-1lvq4s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-p1j7zs5epd-w5wgny-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-p1j7zs5epd-9nvf3o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-p1j7zs5epd-cbov0g-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-iife4h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-p1j7zs5epd-iife4h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-p1j7zs5epd-wsmws4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-p1j7zs5epd-wsmws4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-p1j7zs5epd-a7x5k5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-p1j7zs5epd-prezne-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-p1j7zs5epd-msfc74-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-p1j7zs5epd-a7x5k5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-p1j7zs5epd-prezne-POST-200]
module.svep.data.archive_file.binaries_layer: Still reading... [1m20s elapsed]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-p1j7zs5epd-vttodl-GET-200]
module.svep.data.archive_file.binaries_layer: Still reading... [1m30s elapsed]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=ub9q6z]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-p1j7zs5epd-2f7zka-OPTIONS-200]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-p1j7zs5epd-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:11" -> (known after apply)
      ~ code_sha256                 = "SuWIeVdzYf2AoQmGY59QeAiqZSAlAlTSh4gRse9Aep0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-16T09:05:26.154+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "SuWIeVdzYf2AoQmGY59QeAiqZSAlAlTSh4gRse9Aep0=" -> "7M9TOckrMvrfWv9LU4Ea+YyLISaWPudOTePj9JeEu7E=" # forces replacement
      ~ source_code_size            = 12549632 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "135437598" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733976964975185000" -> "1734423259615236000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-dataPortal-0"
        name             = "sbeacon-backend-dataPortal-0"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = [
                            "sagemaker:UpdateNotebookInstance",
                            "sagemaker:StopNotebookInstance",
                            "sagemaker:StartNotebookInstance",
                            "sagemaker:ListNotebookInstances",
                            "sagemaker:DescribeNotebookInstance",
                            "sagemaker:DeleteNotebookInstance",
                            "sagemaker:CreatePresignedNotebookInstanceUrl",
                            "sagemaker:CreateNotebookInstance",
                            "sagemaker:AddTags",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sagemaker:ap-southeast-3:209479276142:notebook-instance/*"
                    },
                  + {
                      + Action   = "sagemaker:ListNotebookInstances"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = "iam:PassRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::209479276142:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/be07c1c26dcfd4728396ea80377809adb795217cdf571ad51348e7ca0d33655c.zip" -> "builds/2c80caeb2a878ae26243fd12557a9dd12bb1055bf13fab38a33e895226d927de.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2024-12-16T09:47:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2c80caeb2a878ae26243fd12557a9dd12bb1055bf13fab38a33e895226d927de.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2c80caeb2a878ae26243fd12557a9dd12bb1055bf13fab38a33e895226d927de.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "650183136" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/be07c1c26dcfd4728396ea80377809adb795217cdf571ad51348e7ca0d33655c.zip" -> "builds/2c80caeb2a878ae26243fd12557a9dd12bb1055bf13fab38a33e895226d927de.zip"
          ~ "timestamp" = "1734339876185713000" -> "1734423259832235000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1344494170" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167008982000" -> "1734423264129982000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "177329060" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167067285000" -> "1734423264812365000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1546497561" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216634527000" -> "1734423269007734000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1785165514" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167847609000" -> "1734423261530744000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1861200628" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216193988000" -> "1734423266601753000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1452385526" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167994541800" -> "1734423267510629000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1657578501" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167133748000" -> "1734423267301836000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2012440943" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722168045523000" -> "1734423266705396800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "307501127" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216384512000" -> "1734423264001735000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "724748317" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215871723800" -> "1734423267102073000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "778075637" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733490785299055000" -> "1734423266211836000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "684605311" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722168758519000" -> "1734423265906232200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "782786124" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1734339876160202000" -> "1734423268334162000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "318026567" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216134814000" -> "1734423269124780800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1508095487" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215683118200" -> "1734423261525457000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "888823680" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216011071000" -> "1734423267807712000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "698395231" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733933275029878000" -> "1734423268914763000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:22",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1074627158" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215639858000" -> "1734423263912002000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9" -> (known after apply)
      ~ code_sha256                 = "ARRTg1LwxhVOOVAtxd45UZnRhuH5qB8nZPsTg3usi8k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-16T09:05:57.387+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22994383 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20241216090518507400000002/builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "f7ae3a7190b87115fccd30c223880693-5" -> (known after apply)
      ~ id                            = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ key                           = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "409244953" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
          ~ "timestamp" = "1733446544741369000" -> "1734423265024870000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "774799040" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1734339875300872000" -> "1734423265319477000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:bca94b14c781e6ccdab804252375a0e4d1e4655f69d3a09dc9c2f17524613ecb209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:bca94b14c781e6ccdab804252375a0e4d1e4655f69d3a09dc9c2f17524613ecb" -> (known after apply)
        name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:88ecf67553a55e8e492d0d70d4b4e273b172121341acb0cc55be7b48668393a7" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "0f76f49dc58697b6e4305f5218a4a67aa563816e" -> "cb3f8b83210764469c815aeb2e16c9d13fcab4d3"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_arg       = {} -> null
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (11 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (11 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:88ecf67553a55e8e492d0d70d4b4e273b172121341acb0cc55be7b48668393a7" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:88ecf67553a55e8e492d0d70d4b4e273b172121341acb0cc55be7b48668393a7" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "0f76f49dc58697b6e4305f5218a4a67aa563816e" -> "cb3f8b83210764469c815aeb2e16c9d13fcab4d3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:88ecf67553a55e8e492d0d70d4b4e273b172121341acb0cc55be7b48668393a7" -> (known after apply)
      ~ last_modified                  = "2024-12-16T09:07:02.288+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "583311384" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733912651701184000" -> "1734423269004447000"
            # (1 unchanged element hidden)
        }
    }

Plan: 30 to add, 21 to change, 28 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.svep.aws_api_gateway_deployment.VPApi,
│   on svep/api.tf line 281, in resource "aws_api_gateway_deployment" "VPApi":
│  281:   stage_name  = "prod"
│ 
│ The attribute "stage_name" will be removed in a future major version. Use
│ an explicit "aws_api_gateway_stage" instead.
╵
╷
│ Error: Archive creation error
│ 
│   with module.svep.data.archive_file.binaries_layer,
│   on svep/layers.tf line 3, in data "archive_file" "binaries_layer":
│    3: data "archive_file" "binaries_layer" {
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory: svep/layers/binaries/
╵


```
</details>